tangyangguang/Esp32Base/src/update/Esp32BaseOta.inc
#include "../Esp32BaseProfile.h"

#if ESP32BASE_ENABLE_OTA

#include "Esp32BaseOta.h"
#include "internal/Esp32BaseOtaLifecycle.h"
#include "../runtime/Esp32BaseStorage.h"
#include "../core/Esp32BaseConfig.h"
#include "../core/Esp32BaseLog.h"
#include "../core/Esp32BaseSystem.h"

#if ESP32BASE_ENABLE_FILELOG
#include "../runtime/Esp32BaseFileLog.h"
#endif
#if ESP32BASE_ENABLE_BUS
#include "../runtime/Esp32BaseBus.h"
#endif
#if ESP32BASE_ENABLE_WIFI
#include "../network/Esp32BaseWiFi.h"
#endif
#if ESP32BASE_ENABLE_WATCHDOG
#include "../runtime/Esp32BaseWatchdog.h"
#endif
#include "../runtime/internal/Esp32BaseLongOperation.h"
#include "internal/Esp32BaseOtaCompat.h"
#include <Update.h>
#include <esp_err.h>
#include <esp_log.h>
#include <esp_ota_ops.h>
#include <esp_timer.h>
#include <mbedtls/sha256.h>
#if __has_include(<mbedtls/version.h>)
#include <mbedtls/version.h>
#endif
#include <ctype.h>
#include <string.h>

namespace {
esp32base_internal::PreOtaUploadHook g_otaPreUploadHook = nullptr;
bool g_otaReady = false;
uint32_t g_otaLastProgressMs = 0;
Esp32BaseOta::Status g_otaStatus = Esp32BaseOta::IDLE;
size_t g_otaTotal = 0;
size_t g_otaProcessed = 0;
uint8_t g_otaNextProgressLog = 10;
char g_otaExpected[65] = "";
char g_otaCalculated[65] = "";
char g_otaLastError[160] = "";
mbedtls_sha256_context g_otaSha;
bool g_otaShaActive = false;
bool g_otaPrevPowerSave = true;
bool g_otaLongOpsActive = false;
#if ESP32BASE_ENABLE_WATCHDOG
bool g_otaWatchdogEntered = false;
#endif
bool g_otaStorageWritesSuspended = false;
uint32_t g_otaTransferStartedMs = 0;
uint32_t g_otaTransferFinishedMs = 0;
bool g_otaSummaryLogged = false;
uint32_t g_otaBootMs = 0;
bool g_otaBootTimingStarted = false;
const esp_partition_t* g_otaBootPartition = nullptr;
bool g_otaWaitingForMarkValidLogged = false;
bool g_otaMarkValidTimeoutHandled = false;
#if ESP32BASE_OTA_REQUIRE_MARK_VALID
esp_timer_handle_t g_otaBootGuardTimer = nullptr;
bool g_otaBootGuardArmed = false;
esp_err_t g_otaBootGuardArmError = ESP_OK;
#endif
const esp_partition_t* g_otaTargetPartition = nullptr;
char g_otaTargetPartitionLabel[17] = "";
uint32_t g_otaTargetPartitionAddress = 0;
size_t g_otaTargetPartitionSize = 0;
char g_otaLastBootPartitionLabel[17] = "";
uint32_t g_otaLastBootPartitionAddress = 0;
size_t g_otaLastBootPartitionSize = 0;
char g_otaStage[17] = "idle";

void bytesToHex(const uint8_t* bytes, size_t len, char* out, size_t outLen) {
    static const char* hex = "0123456789abcdef";
    if (!out || outLen < len * 2 + 1) {
        return;
    }
    for (size_t i = 0; i < len; ++i) {
        out[i * 2] = hex[(bytes[i] >> 4) & 0x0f];
        out[i * 2 + 1] = hex[bytes[i] & 0x0f];
    }
    out[len * 2] = '\0';
}

bool sameOtaPartition(const esp_partition_t* a, const esp_partition_t* b) {
    return a && b && a->address == b->address && a->size == b->size &&
           a->type == b->type && a->subtype == b->subtype &&
           strncmp(a->label, b->label, sizeof(a->label)) == 0;
}

void storePartition(const esp_partition_t* partition, char* label, size_t labelLen, uint32_t& address, size_t& size) {
    if (label && labelLen) {
        label[0] = '\0';
    }
    address = 0;
    size = 0;
    if (!partition) {
        return;
    }
    if (label && labelLen) {
        strlcpy(label, partition->label, labelLen);
    }
    address = partition->address;
    size = partition->size;
}

const char* partitionLabelOrUnknown(const esp_partition_t* partition) {
    return partition && partition->label[0] ? partition->label : "unknown";
}

uint32_t partitionAddressOrZero(const esp_partition_t* partition) {
    return partition ? partition->address : 0;
}

const char* otaStateName(esp_ota_img_states_t state) {
    switch (state) {
        case ESP_OTA_IMG_NEW: return "new";
        case ESP_OTA_IMG_PENDING_VERIFY: return "pending_verify";
        case ESP_OTA_IMG_VALID: return "valid";
        case ESP_OTA_IMG_INVALID: return "invalid";
        case ESP_OTA_IMG_ABORTED: return "aborted";
        case ESP_OTA_IMG_UNDEFINED: return "undefined";
        default: return "unknown";
    }
}

const char* partitionOtaStateName(const esp_partition_t* partition) {
    if (!partition || partition->type != ESP_PARTITION_TYPE_APP ||
        partition->subtype < ESP_PARTITION_SUBTYPE_APP_OTA_MIN ||
        partition->subtype > ESP_PARTITION_SUBTYPE_APP_OTA_MAX) {
        return "n/a";
    }
    esp_ota_img_states_t state;
    const esp_err_t err = esp_ota_get_state_partition(partition, &state);
    if (err == ESP_ERR_NOT_FOUND) {
        return "undefined";
    }
    if (err != ESP_OK) {
        return "unknown";
    }
    return otaStateName(state);
}

bool currentRunningOtaState(esp_ota_img_states_t& state, esp_err_t& err) {
    const esp_partition_t* running = esp_ota_get_running_partition();
    state = ESP_OTA_IMG_UNDEFINED;
    err = running ? esp_ota_get_state_partition(running, &state) : ESP_ERR_NOT_FOUND;
    return err == ESP_OK;
}

#if ESP32BASE_OTA_REQUIRE_MARK_VALID
void otaBootGuardTimeout(void*) {
    g_otaBootGuardArmed = false;
    const esp_partition_t* running = esp_ota_get_running_partition();
    esp_ota_img_states_t state = ESP_OTA_IMG_UNDEFINED;
    const esp_err_t stateErr = running ? esp_ota_get_state_partition(running, &state) : ESP_ERR_NOT_FOUND;
    if (stateErr != ESP_OK || state != ESP_OTA_IMG_PENDING_VERIFY) {
        return;
    }

    ESP_EARLY_LOGE("ota",
                   "boot confirmation timeout; invalidating unconfirmed partition %s at 0x%lx",
                   partitionLabelOrUnknown(running),
                   static_cast<unsigned long>(partitionAddressOrZero(running)));
    const esp_err_t err = esp_ota_mark_app_invalid_rollback_and_reboot();
    ESP_EARLY_LOGE("ota", "automatic rollback failed: %s", esp_err_to_name(err));
}

void armOtaBootGuard() {
    if (g_otaBootGuardArmed) {
        return;
    }
    esp_ota_img_states_t state = ESP_OTA_IMG_UNDEFINED;
    esp_err_t stateErr = ESP_OK;
    if (!currentRunningOtaState(state, stateErr) || state != ESP_OTA_IMG_PENDING_VERIFY) {
        return;
    }
    if (!g_otaBootTimingStarted) {
        g_otaBootMs = millis();
        g_otaBootTimingStarted = true;
    }

    if (!g_otaBootGuardTimer) {
        esp_timer_create_args_t args = {};
        args.callback = otaBootGuardTimeout;
        args.name = "eb_ota_guard";
        g_otaBootGuardArmError = esp_timer_create(&args, &g_otaBootGuardTimer);
        if (g_otaBootGuardArmError != ESP_OK) {
            return;
        }
    }
    // Retrying timer setup must not extend the original boot deadline.
    const uint32_t elapsedMs = millis() - g_otaBootMs;
    const uint64_t remainingUs = elapsedMs >= ESP32BASE_OTA_MARK_VALID_TIMEOUT_MS ? 1ULL :
        static_cast<uint64_t>(ESP32BASE_OTA_MARK_VALID_TIMEOUT_MS - elapsedMs) * 1000ULL;
    g_otaBootGuardArmError = esp_timer_start_once(g_otaBootGuardTimer, remainingUs);
    g_otaBootGuardArmed = g_otaBootGuardArmError == ESP_OK;
}

void stopOtaBootGuard() {
    if (!g_otaBootGuardTimer) {
        return;
    }
    if (g_otaBootGuardArmed) {
        esp_timer_stop(g_otaBootGuardTimer);
        g_otaBootGuardArmed = false;
    }
}
#endif

void formatOtaBytes(size_t bytes, char* out, size_t len);

void setOtaStage(const char* stage) {
    strlcpy(g_otaStage, stage && stage[0] ? stage : "unknown", sizeof(g_otaStage));
}

void setError(const char* message) {
    strlcpy(g_otaLastError, message ? message : "", sizeof(g_otaLastError));
    char processedBuf[32];
    char totalBuf[32];
    formatOtaBytes(g_otaProcessed, processedBuf, sizeof(processedBuf));
    formatOtaBytes(g_otaTotal, totalBuf, sizeof(totalBuf));
    ESP32BASE_LOG_E("ota", "stage=%s error=%s target=%s address=0x%lx bytes=%s total=%s progress=%u%%",
                    g_otaStage[0] ? g_otaStage : "unknown",
                    g_otaLastError,
                    g_otaTargetPartitionLabel[0] ? g_otaTargetPartitionLabel : "unknown",
                    static_cast<unsigned long>(g_otaTargetPartitionAddress),
                    processedBuf,
                    totalBuf,
                    static_cast<unsigned>(Esp32BaseOta::progress()));
#if ESP32BASE_ENABLE_BUS
    Esp32BaseBus::publish(Esp32BaseOta::EVENT_FAILED, g_otaLastError);
#endif
}

bool copySha256Hex(const char* in, char* out, size_t outLen) {
    if (!in || !out || outLen < 65 || strlen(in) != 64) {
        return false;
    }
    for (size_t i = 0; i < 64; ++i) {
        const unsigned char c = static_cast<unsigned char>(in[i]);
        if (!isxdigit(c)) {
            return false;
        }
        out[i] = static_cast<char>(tolower(c));
    }
    out[64] = '\0';
    return true;
}

void cleanupLongOps() {
    if (!g_otaLongOpsActive) {
        return;
    }
#if ESP32BASE_ENABLE_WATCHDOG
    if (g_otaWatchdogEntered) {
        Esp32BaseWatchdog::exitLongOperation();
        g_otaWatchdogEntered = false;
    }
#endif
#if ESP32BASE_ENABLE_WIFI
    Esp32BaseWiFi::setPowerSave(g_otaPrevPowerSave);
#endif
#if ESP32BASE_ENABLE_FS
    if (g_otaStorageWritesSuspended) {
        Esp32BaseStorage::setOtaWriteSuspended(false);
        g_otaStorageWritesSuspended = false;
    }
#endif
    Esp32BaseConfig::resumeDeferredFlush();
    g_otaLongOpsActive = false;
}

bool prepareLongOps() {
#if ESP32BASE_ENABLE_FS
    if (!Esp32BaseStorage::setOtaWriteSuspended(true)) {
        return false;
    }
    g_otaStorageWritesSuspended = true;
#endif
    g_otaLongOpsActive = true;
#if ESP32BASE_ENABLE_WIFI
    g_otaPrevPowerSave = Esp32BaseWiFi::powerSave();
#endif
    Esp32BaseConfig::pauseDeferredFlush();
#if ESP32BASE_ENABLE_WATCHDOG
    g_otaWatchdogEntered = Esp32BaseWatchdog::enterLongOperation();
    if (!g_otaWatchdogEntered) {
        cleanupLongOps();
        return false;
    }
#endif
#if ESP32BASE_ENABLE_WIFI
    Esp32BaseWiFi::setPowerSave(false);
#endif
    return true;
}

void sha256Starts(mbedtls_sha256_context* ctx) {
#if defined(MBEDTLS_VERSION_MAJOR) && MBEDTLS_VERSION_MAJOR >= 3 && defined(MBEDTLS_SHA256_SHA256)
    mbedtls_sha256_starts(ctx, MBEDTLS_SHA256_SHA256);
#else
    mbedtls_sha256_starts(ctx, 0);
#endif
}

void formatOtaBytes(size_t bytes, char* out, size_t len) {
    if (!out || len == 0) {
        return;
    }
    if (bytes >= 1024UL * 1024UL) {
        snprintf(out, len, "%.2f MB", static_cast<double>(bytes) / 1024.0 / 1024.0);
    } else if (bytes >= 1024UL) {
        snprintf(out, len, "%.2f KB", static_cast<double>(bytes) / 1024.0);
    } else {
        snprintf(out, len, "%lu B", static_cast<unsigned long>(bytes));
    }
}

void formatOtaBytesShort(double bytes, char* out, size_t len) {
    if (!out || len == 0) {
        return;
    }
    if (bytes >= 1024.0 * 1024.0) {
        snprintf(out, len, "%.1f MB", bytes / 1024.0 / 1024.0);
    } else if (bytes >= 1024.0) {
        snprintf(out, len, "%.1f KB", bytes / 1024.0);
    } else {
        snprintf(out, len, "%.0f B", bytes);
    }
}

