tangyangguang/Esp32Base/src/update/Esp32BaseOta.inc
void resetOtaTransferStats() {
    g_otaTransferStartedMs = millis();
    g_otaTransferFinishedMs = 0;
    g_otaSummaryLogged = false;
}

void finishOtaTransferStats() {
    if (g_otaTransferStartedMs != 0 && g_otaTransferFinishedMs == 0) {
        g_otaTransferFinishedMs = millis();
    }
}

void logOtaTransferSummary(const char* prefix) {
    if (g_otaSummaryLogged || g_otaTransferStartedMs == 0) {
        return;
    }
    g_otaSummaryLogged = true;
    finishOtaTransferStats();
    const uint32_t durationMs = g_otaTransferFinishedMs - g_otaTransferStartedMs;
    const double durationSec = static_cast<double>(durationMs) / 1000.0;
    char uploadedBuf[32];
    char speedBuf[40];
    formatOtaBytesShort(static_cast<double>(g_otaProcessed), uploadedBuf, sizeof(uploadedBuf));
    if (durationSec >= 0.1) {
        char speedBytes[32];
        formatOtaBytesShort(static_cast<double>(g_otaProcessed) / durationSec, speedBytes, sizeof(speedBytes));
        snprintf(speedBuf, sizeof(speedBuf), "%s/s", speedBytes);
    } else {
        strlcpy(speedBuf, "n/a", sizeof(speedBuf));
    }
    ESP32BASE_LOG_I("ota", "%s duration=%.2fs uploaded=%s average=%s",
                    prefix && prefix[0] ? prefix : "upload_summary",
                    durationSec,
                    uploadedBuf,
                    speedBuf);
}

void logProgressIfDue() {
    const uint8_t currentProgress = Esp32BaseOta::progress();
    while (g_otaNextProgressLog <= 100U && currentProgress >= g_otaNextProgressLog) {
        char processedBuf[32];
        char totalBuf[32];
        formatOtaBytes(g_otaProcessed, processedBuf, sizeof(processedBuf));
        formatOtaBytes(g_otaTotal, totalBuf, sizeof(totalBuf));
        setOtaStage("write");
        ESP32BASE_LOG_I("ota", "upload_progress stage=write progress=%u%% bytes=%s total=%s target=%s address=0x%lx",
                        static_cast<unsigned>(g_otaNextProgressLog),
                        processedBuf,
                        totalBuf,
                        g_otaTargetPartitionLabel[0] ? g_otaTargetPartitionLabel : "unknown",
                        static_cast<unsigned long>(g_otaTargetPartitionAddress));
        g_otaNextProgressLog = static_cast<uint8_t>(g_otaNextProgressLog + 10U);
    }
}

void logUploadStage(const char* stage) {
    setOtaStage(stage);
    char processedBuf[32];
    char totalBuf[32];
    formatOtaBytes(g_otaProcessed, processedBuf, sizeof(processedBuf));
    formatOtaBytes(g_otaTotal, totalBuf, sizeof(totalBuf));
    ESP32BASE_LOG_I("ota", "upload_stage stage=%s target=%s address=0x%lx progress=%u%% bytes=%s total=%s",
                    g_otaStage,
                    g_otaTargetPartitionLabel[0] ? g_otaTargetPartitionLabel : "unknown",
                    static_cast<unsigned long>(g_otaTargetPartitionAddress),
                    static_cast<unsigned>(Esp32BaseOta::progress()),
                    processedBuf,
                    totalBuf);
}

void checkMarkValidTimeout() {
#if ESP32BASE_OTA_REQUIRE_MARK_VALID
    if (!g_otaReady || !g_otaBootPartition || esp_ota_get_running_partition() != g_otaBootPartition ||
        g_otaMarkValidTimeoutHandled) {
        return;
    }

    esp_ota_img_states_t state;
    const esp_err_t err = esp_ota_get_state_partition(g_otaBootPartition, &state);
    if (err != ESP_OK || state != ESP_OTA_IMG_PENDING_VERIFY) {
        return;
    }

    if (!g_otaWaitingForMarkValidLogged) {
        g_otaWaitingForMarkValidLogged = true;
        ESP32BASE_LOG_W("ota",
                        "waiting_for_mark_valid partition=%s address=0x%lx state=%s elapsed_ms=%lu timeout_ms=%lu",
                        partitionLabelOrUnknown(g_otaBootPartition),
                        static_cast<unsigned long>(partitionAddressOrZero(g_otaBootPartition)),
                        otaStateName(state),
                        static_cast<unsigned long>(millis() - g_otaBootMs),
                        static_cast<unsigned long>(ESP32BASE_OTA_MARK_VALID_TIMEOUT_MS));
    }

    // A successfully started timer owns the deadline, even while its callback
    // is running (and has cleared Armed). Two rollback calls can race on OTA
    // metadata. The loop is only a fallback for timer creation/start failure.
    if (g_otaBootGuardArmError != ESP_OK &&
        millis() - g_otaBootMs >= ESP32BASE_OTA_MARK_VALID_TIMEOUT_MS) {
        g_otaMarkValidTimeoutHandled = true;
        ESP32BASE_LOG_E("ota",
                        "mark_valid_timeout partition=%s address=0x%lx state=%s elapsed_ms=%lu timeout_ms=%lu",
                        partitionLabelOrUnknown(g_otaBootPartition),
                        static_cast<unsigned long>(partitionAddressOrZero(g_otaBootPartition)),
                        otaStateName(state),
                        static_cast<unsigned long>(millis() - g_otaBootMs),
                        static_cast<unsigned long>(ESP32BASE_OTA_MARK_VALID_TIMEOUT_MS));
        Esp32BaseOta::rollbackAndRestart("ota mark-valid timeout");
    }
#endif
}

}

#if ESP32BASE_OTA_REQUIRE_MARK_VALID
extern "C" bool verifyRollbackLater() {
    // Arduino calls this before setup(). Arm the confirmation deadline here so
    // rollback does not depend on Esp32Base::begin(), the application loop, or
    // cooperative Esp32Base::handle() calls.
    armOtaBootGuard();
    return true;
}
#endif

bool Esp32BaseOta::begin() {
    g_otaReady = true;
    g_otaStatus = READY;
    if (!g_otaBootTimingStarted) {
        g_otaBootMs = millis();
        g_otaBootTimingStarted = true;
    }
    g_otaBootPartition = esp_ota_get_running_partition();
    g_otaWaitingForMarkValidLogged = false;
    g_otaMarkValidTimeoutHandled = false;
    const esp_partition_t* configuredBootPartition = esp_ota_get_boot_partition();
    const esp_partition_t* nextUpdatePartition = esp_ota_get_next_update_partition(nullptr);
    const esp_partition_t* lastInvalidPartition = esp_ota_get_last_invalid_partition();
    const char* runningOtaState = partitionOtaStateName(g_otaBootPartition);
    const bool waitingForMarkValid = strcmp(runningOtaState, "pending_verify") == 0;
    char runningElfSha256[65] = "";
    esp32base_internal::appElfSha256(runningElfSha256, sizeof(runningElfSha256));
    ESP32BASE_LOG_I("ota",
                    "boot_summary running_partition=%s address=0x%lx running_ota_state=%s configured_boot_partition=%s address=0x%lx configured_boot_state=%s next_update_partition=%s address=0x%lx next_update_state=%s mark_valid_policy=%s waiting_for_mark_valid=%s timeout_ms=%lu elf_sha256=%s",
                    partitionLabelOrUnknown(g_otaBootPartition),
                    static_cast<unsigned long>(partitionAddressOrZero(g_otaBootPartition)),
                    runningOtaState,
                    partitionLabelOrUnknown(configuredBootPartition),
                    static_cast<unsigned long>(partitionAddressOrZero(configuredBootPartition)),
                    partitionOtaStateName(configuredBootPartition),
                    partitionLabelOrUnknown(nextUpdatePartition),
                    static_cast<unsigned long>(partitionAddressOrZero(nextUpdatePartition)),
                    partitionOtaStateName(nextUpdatePartition),
#if ESP32BASE_OTA_REQUIRE_MARK_VALID
                    "require_manual",
#else
                    "arduino_default",
#endif
                    waitingForMarkValid ? "yes" : "no",
                    static_cast<unsigned long>(ESP32BASE_OTA_MARK_VALID_TIMEOUT_MS),
                    runningElfSha256[0] ? runningElfSha256 : "unavailable");
    if (g_otaBootPartition && configuredBootPartition && !sameOtaPartition(g_otaBootPartition, configuredBootPartition)) {
        ESP32BASE_LOG_W("ota", "boot_partition_mismatch running_partition=%s configured_boot_partition=%s",
                        partitionLabelOrUnknown(g_otaBootPartition),
                        partitionLabelOrUnknown(configuredBootPartition));
    }
    if (lastInvalidPartition && !sameOtaPartition(lastInvalidPartition, g_otaBootPartition)) {
        const char* lastInvalidState = partitionOtaStateName(lastInvalidPartition);
        const char* reason = strcmp(lastInvalidState, "aborted") == 0
                                 ? "reset_before_confirmation"
                                 : "self_test_rejected_or_confirmation_timeout";
        ESP32BASE_LOG_E("ota",
                        "previous_image_rejected partition=%s address=0x%lx state=%s reason=%s",
                        partitionLabelOrUnknown(lastInvalidPartition),
                        static_cast<unsigned long>(partitionAddressOrZero(lastInvalidPartition)),
                        lastInvalidState,
                        reason);
    }
    if (g_otaBootPartition) {
        char sizeBuf[32];
        formatOtaBytes(g_otaBootPartition->size, sizeBuf, sizeof(sizeBuf));
        ESP32BASE_LOG_I("ota", "ready running_partition=%s address=0x%lx size=%s ota_state=%s elf_sha256=%s",
                        g_otaBootPartition->label,
                        static_cast<unsigned long>(g_otaBootPartition->address),
                        sizeBuf,
                        runningOtaState,
                        runningElfSha256[0] ? runningElfSha256 : "unavailable");
    } else {
        ESP32BASE_LOG_I("ota", "ready running_partition=unknown elf_sha256=%s",
                        runningElfSha256[0] ? runningElfSha256 : "unavailable");
    }
    if (configuredBootPartition) {
        ESP32BASE_LOG_I("ota", "configured_boot_partition=%s address=0x%lx",
                        configuredBootPartition->label,
                        static_cast<unsigned long>(configuredBootPartition->address));
    }
    if (waitingForMarkValid) {
#if ESP32BASE_OTA_REQUIRE_MARK_VALID
        armOtaBootGuard();
        ESP32BASE_LOG_W("ota", "mark_valid_required app must call Esp32BaseOta::markCurrentValid() after self-check");
        if (!g_otaBootGuardArmed) {
            ESP32BASE_LOG_E("ota", "boot_guard_arm_failed err=%s fallback=cooperative_handle_timeout",
                            esp_err_to_name(g_otaBootGuardArmError));
        }
#else
        ESP32BASE_LOG_W("ota", "running_partition_pending_verify but ESP32BASE_OTA_REQUIRE_MARK_VALID=0; Arduino core may mark it valid before Esp32Base begins");
#endif
    }
    return true;
}

void Esp32BaseOta::handle() {
    checkMarkValidTimeout();
    if (g_otaStatus == UPLOADING && millis() - g_otaLastProgressMs >= 15000U) {
        abortUpload("ota upload stalled");
    }
}

void esp32base_internal::registerPreOtaUploadHook(PreOtaUploadHook hook) {
    g_otaPreUploadHook = hook;
}

