tangyangguang/Esp32Base/src/update/Esp32BaseOta.inc
bool Esp32BaseOta::isReady() {
    return g_otaReady;
}

bool Esp32BaseOta::isUploading() {
    return g_otaStatus == UPLOADING || g_otaStatus == VERIFYING;
}

Esp32BaseOta::Status Esp32BaseOta::status() {
    return g_otaStatus;
}

bool Esp32BaseOta::startUpload(size_t totalSize, const char* expectedSha256Hex) {
    if (isUploading()) {
        setError("ota already in progress");
        return false;
    }
    setOtaStage("begin");
    if (totalSize == 0) {
        setError("invalid ota size");
        g_otaStatus = FAILED;
        return false;
    }
    const esp_partition_t* nextPartition = esp_ota_get_next_update_partition(nullptr);
    if (!nextPartition) {
        setError("no ota update partition");
        g_otaStatus = FAILED;
        return false;
    }
    if (totalSize > nextPartition->size) {
        char totalBuf[32];
        char partitionBuf[32];
        char message[96];
        formatOtaBytes(totalSize, totalBuf, sizeof(totalBuf));
        formatOtaBytes(nextPartition->size, partitionBuf, sizeof(partitionBuf));
        snprintf(message, sizeof(message), "ota size too large: firmware=%s partition=%s", totalBuf, partitionBuf);
        setError(message);
        g_otaStatus = FAILED;
        return false;
    }
    g_otaTotal = totalSize;
    g_otaProcessed = 0;
    g_otaNextProgressLog = 10;
    g_otaExpected[0] = '\0';
    g_otaCalculated[0] = '\0';
    g_otaLastError[0] = '\0';
    g_otaTargetPartition = nextPartition;
    storePartition(nextPartition,
                   g_otaTargetPartitionLabel,
                   sizeof(g_otaTargetPartitionLabel),
                   g_otaTargetPartitionAddress,
                   g_otaTargetPartitionSize);
    storePartition(nullptr,
                   g_otaLastBootPartitionLabel,
                   sizeof(g_otaLastBootPartitionLabel),
                   g_otaLastBootPartitionAddress,
                   g_otaLastBootPartitionSize);
    resetOtaTransferStats();
    if (expectedSha256Hex && expectedSha256Hex[0]) {
        if (!copySha256Hex(expectedSha256Hex, g_otaExpected, sizeof(g_otaExpected))) {
            setError("invalid sha256 hex");
            logOtaTransferSummary("upload_failed");
            g_otaStatus = FAILED;
            return false;
        }
    }

    if (!prepareLongOps()) {
        setError("unable to prepare ota resources");
        logOtaTransferSummary("upload_failed");
        g_otaStatus = FAILED;
        return false;
    }

    if (g_otaPreUploadHook && !g_otaPreUploadHook()) {
        cleanupLongOps();
        setError("network shutdown was not confirmed");
        logOtaTransferSummary("upload_failed");
        g_otaStatus = FAILED;
        return false;
    }

    if (!Update.begin(totalSize)) {
        cleanupLongOps();
        char message[96];
        snprintf(message, sizeof(message), "Update.begin failed: %s", Update.errorString());
        setError(message);
        logOtaTransferSummary("upload_failed");
        g_otaStatus = FAILED;
        return false;
    }

    mbedtls_sha256_init(&g_otaSha);
    sha256Starts(&g_otaSha);
    g_otaShaActive = true;
    g_otaLastProgressMs = millis();
    g_otaStatus = UPLOADING;
    char totalBuf[32];
    formatOtaBytes(g_otaTotal, totalBuf, sizeof(totalBuf));
    ESP32BASE_LOG_I("ota", "upload_start stage=begin size=%s sha256=%s upload_target=%s address=0x%lx",
                    totalBuf,
                    g_otaExpected[0] ? "provided" : "none",
                    g_otaTargetPartitionLabel[0] ? g_otaTargetPartitionLabel : "unknown",
                    static_cast<unsigned long>(g_otaTargetPartitionAddress));
#if ESP32BASE_ENABLE_BUS
    Esp32BaseBus::publish(EVENT_START, "");
#endif
    return true;
}

bool Esp32BaseOta::writeChunk(const uint8_t* data, size_t len) {
    if (g_otaStatus != UPLOADING || !data) {
        return false;
    }
    if (g_otaProcessed > g_otaTotal || len > g_otaTotal - g_otaProcessed) {
        abortUpload("ota size overflow");
        return false;
    }
    if (Update.write(const_cast<uint8_t*>(data), len) != len) {
        finishOtaTransferStats();
        abortUpload("Update.write failed");
        return false;
    }
    if (g_otaShaActive) {
        mbedtls_sha256_update(&g_otaSha, data, len);
    }
    g_otaProcessed += len;
    if (len > 0) {
        g_otaLastProgressMs = millis();
    }
    logProgressIfDue();
    Esp32BaseLongOperation::service();
#if ESP32BASE_ENABLE_BUS
    Esp32BaseBus::publish(EVENT_PROGRESS, "");
#endif
    return true;
}

bool Esp32BaseOta::finishUpload() {
    if (g_otaStatus != UPLOADING) {
        return false;
    }
    g_otaStatus = VERIFYING;
    logUploadStage("verify");

    uint8_t digest[32];
    char actual[65];
    if (g_otaShaActive) {
        mbedtls_sha256_finish(&g_otaSha, digest);
        mbedtls_sha256_free(&g_otaSha);
        g_otaShaActive = false;
        bytesToHex(digest, sizeof(digest), actual, sizeof(actual));
        strlcpy(g_otaCalculated, actual, sizeof(g_otaCalculated));
    } else {
        actual[0] = '\0';
        g_otaCalculated[0] = '\0';
    }

    if (g_otaExpected[0] && strcmp(g_otaExpected, actual) != 0) {
        Update.abort();
        cleanupLongOps();
        finishOtaTransferStats();
        setError("sha256 mismatch");
        logOtaTransferSummary("upload_failed");
        g_otaStatus = FAILED;
        return false;
    }

    if (g_otaProcessed != g_otaTotal) {
        Update.abort();
        cleanupLongOps();
        finishOtaTransferStats();
        setError("ota size mismatch");
        logOtaTransferSummary("upload_failed");
        g_otaStatus = FAILED;
        return false;
    }

    logUploadStage("set_boot");
    if (!Update.end(true)) {
        cleanupLongOps();
        finishOtaTransferStats();
        setError("Update.end failed");
        logOtaTransferSummary("upload_failed");
        g_otaStatus = FAILED;
        return false;
    }

    const esp_partition_t* bootPartition = esp_ota_get_boot_partition();
    storePartition(bootPartition,
                   g_otaLastBootPartitionLabel,
                   sizeof(g_otaLastBootPartitionLabel),
                   g_otaLastBootPartitionAddress,
                   g_otaLastBootPartitionSize);
    setOtaStage("boot_confirmed");
    ESP32BASE_LOG_I("ota", "upload_stage stage=boot_confirmed target=%s address=0x%lx boot_partition=%s boot_address=0x%lx",
                    g_otaTargetPartitionLabel[0] ? g_otaTargetPartitionLabel : "unknown",
                    static_cast<unsigned long>(g_otaTargetPartitionAddress),
                    g_otaLastBootPartitionLabel[0] ? g_otaLastBootPartitionLabel : "unknown",
                    static_cast<unsigned long>(g_otaLastBootPartitionAddress));
    if (!sameOtaPartition(bootPartition, g_otaTargetPartition)) {
        setOtaStage("boot_confirmed");
        cleanupLongOps();
        finishOtaTransferStats();
        char message[96];
        snprintf(message, sizeof(message), "boot partition mismatch target=%s boot=%s",
                 g_otaTargetPartitionLabel[0] ? g_otaTargetPartitionLabel : "unknown",
                 g_otaLastBootPartitionLabel[0] ? g_otaLastBootPartitionLabel : "unknown");
        setError(message);
        logOtaTransferSummary("upload_failed");
        g_otaStatus = FAILED;
        return false;
    }

