tangyangguang/Esp32Base/src/update/Esp32BaseOta.inc
    cleanupLongOps();
    finishOtaTransferStats();
    g_otaStatus = SUCCESS;
    setOtaStage("done");
    char processedBuf[32];
    formatOtaBytes(g_otaProcessed, processedBuf, sizeof(processedBuf));
    ESP32BASE_LOG_I("ota", "upload_success stage=done size=%s sha256=%s boot_partition=%s address=0x%lx",
                    processedBuf,
                    actual[0] ? actual : "unavailable",
                    g_otaLastBootPartitionLabel[0] ? g_otaLastBootPartitionLabel : "unknown",
                    static_cast<unsigned long>(g_otaLastBootPartitionAddress));
    logOtaTransferSummary("upload_summary");
#if ESP32BASE_ENABLE_FILELOG
    Esp32BaseFileLog::flush();
#endif
#if ESP32BASE_ENABLE_BUS
    Esp32BaseBus::publish(EVENT_SUCCESS, "");
#endif
    return true;
}

void Esp32BaseOta::abortUpload(const char* reason) {
    if (g_otaShaActive) {
        mbedtls_sha256_free(&g_otaSha);
        g_otaShaActive = false;
    }
    Update.abort();
    cleanupLongOps();
    finishOtaTransferStats();
    setError(reason ? reason : "ota aborted");
    logOtaTransferSummary("upload_aborted");
    g_otaStatus = FAILED;
}

void Esp32BaseOta::rejectUpload(const char* reason) {
    if (isUploading()) {
        abortUpload(reason ? reason : "ota upload rejected");
        return;
    }
    g_otaTotal = 0;
    g_otaProcessed = 0;
    g_otaExpected[0] = '\0';
    g_otaCalculated[0] = '\0';
    g_otaTargetPartition = nullptr;
    storePartition(nullptr,
                   g_otaTargetPartitionLabel,
                   sizeof(g_otaTargetPartitionLabel),
                   g_otaTargetPartitionAddress,
                   g_otaTargetPartitionSize);
    setError(reason ? reason : "ota upload rejected");
    g_otaStatus = FAILED;
}

uint8_t Esp32BaseOta::progress() {
    if (g_otaTotal == 0) {
        return 0;
    }
    const uint64_t percent = (static_cast<uint64_t>(g_otaProcessed) * 100ULL) / g_otaTotal;
    return percent > 100U ? 100U : static_cast<uint8_t>(percent);
}

size_t Esp32BaseOta::bytesProcessed() {
    return g_otaProcessed;
}

size_t Esp32BaseOta::totalSize() {
    return g_otaTotal;
}

uint32_t Esp32BaseOta::elapsedMs() {
    if (g_otaTransferStartedMs == 0) {
        return 0;
    }
    if (g_otaTransferFinishedMs != 0) {
        return g_otaTransferFinishedMs - g_otaTransferStartedMs;
    }
    return millis() - g_otaTransferStartedMs;
}

uint32_t Esp32BaseOta::averageBytesPerSecond() {
    const uint32_t elapsed = elapsedMs();
    if (elapsed == 0) {
        return 0;
    }
    const uint64_t bytesPerSecond = (static_cast<uint64_t>(g_otaProcessed) * 1000ULL) / elapsed;
    return bytesPerSecond > UINT32_MAX ? UINT32_MAX : static_cast<uint32_t>(bytesPerSecond);
}

const char* Esp32BaseOta::lastError() {
    return g_otaLastError;
}

const char* Esp32BaseOta::expectedSha256() {
    return g_otaExpected;
}

const char* Esp32BaseOta::calculatedSha256() {
    return g_otaCalculated;
}

const char* Esp32BaseOta::lastTargetPartitionLabel() {
    return g_otaTargetPartitionLabel;
}

uint32_t Esp32BaseOta::lastTargetPartitionAddress() {
    return g_otaTargetPartitionAddress;
}

size_t Esp32BaseOta::lastTargetPartitionSize() {
    return g_otaTargetPartitionSize;
}

const char* Esp32BaseOta::lastBootPartitionLabel() {
    return g_otaLastBootPartitionLabel;
}

uint32_t Esp32BaseOta::lastBootPartitionAddress() {
    return g_otaLastBootPartitionAddress;
}

size_t Esp32BaseOta::lastBootPartitionSize() {
    return g_otaLastBootPartitionSize;
}

const char* Esp32BaseOta::runningOtaState() {
    return partitionOtaStateName(esp_ota_get_running_partition());
}

bool Esp32BaseOta::waitingForMarkValid() {
#if ESP32BASE_OTA_REQUIRE_MARK_VALID
    esp_ota_img_states_t state;
    esp_err_t err;
    return currentRunningOtaState(state, err) && state == ESP_OTA_IMG_PENDING_VERIFY;
#else
    return false;
#endif
}

uint32_t Esp32BaseOta::markValidElapsedMs() {
    if (!g_otaBootTimingStarted) {
        return 0;
    }
    return millis() - g_otaBootMs;
}

uint32_t Esp32BaseOta::markValidTimeoutMs() {
    return ESP32BASE_OTA_MARK_VALID_TIMEOUT_MS;
}

bool Esp32BaseOta::markCurrentValid() {
    const esp_partition_t* running = esp_ota_get_running_partition();
    esp_ota_img_states_t state = ESP_OTA_IMG_UNDEFINED;
    const esp_err_t stateErr = running ? esp_ota_get_state_partition(running, &state) : ESP_ERR_NOT_FOUND;
    if (stateErr != ESP_OK) {
        ESP32BASE_LOG_W("ota",
                        "mark_valid skipped partition=%s address=0x%lx state=unknown err=%s",
                        partitionLabelOrUnknown(running),
                        static_cast<unsigned long>(partitionAddressOrZero(running)),
                        esp_err_to_name(stateErr));
        return false;
    }
    if (state != ESP_OTA_IMG_PENDING_VERIFY) {
        ESP32BASE_LOG_W("ota",
                        "mark_valid skipped partition=%s address=0x%lx state=%s reason=not_pending_verify",
                        partitionLabelOrUnknown(running),
                        static_cast<unsigned long>(partitionAddressOrZero(running)),
                        otaStateName(state));
        return false;
    }
    const esp_err_t err = esp_ota_mark_app_valid_cancel_rollback();
    if (err == ESP_OK) {
#if ESP32BASE_OTA_REQUIRE_MARK_VALID
        stopOtaBootGuard();
#endif
        g_otaMarkValidTimeoutHandled = true;
        ESP32BASE_LOG_I("ota",
                        "mark_valid success partition=%s address=0x%lx previous_state=%s elapsed_ms=%lu",
                        partitionLabelOrUnknown(running),
                        static_cast<unsigned long>(partitionAddressOrZero(running)),
                        otaStateName(state),
                        static_cast<unsigned long>(markValidElapsedMs()));
        return true;
    }
    ESP32BASE_LOG_E("ota",
                    "mark_valid failed partition=%s address=0x%lx state=%s err=%s",
                    partitionLabelOrUnknown(running),
                    static_cast<unsigned long>(partitionAddressOrZero(running)),
                    otaStateName(state),
                    esp_err_to_name(err));
    return false;
}

