tangyangguang/Esp32Base/src/update/Esp32BaseOta.inc
bool Esp32BaseOta::isRollbackPossible() {
    return esp_ota_check_rollback_is_possible();
}

void Esp32BaseOta::rollbackAndRestart(const char* reason) {
    const char* rollbackReason = reason ? reason : "ota rollback";
    const esp_partition_t* running = esp_ota_get_running_partition();
    esp_ota_img_states_t state = ESP_OTA_IMG_UNDEFINED;
    const esp_err_t stateErr = running ? esp_ota_get_state_partition(running, &state) : ESP_ERR_NOT_FOUND;
#if ESP32BASE_OTA_REQUIRE_MARK_VALID
    stopOtaBootGuard();
#endif
    Esp32BaseSystem::appendRestartLog(rollbackReason);
    Esp32BaseConfig::flushAll();
#if ESP32BASE_ENABLE_FILELOG
    Esp32BaseFileLog::flush();
#endif
    ESP32BASE_LOG_E("ota",
                    "rollback_restart reason=%s partition=%s address=0x%lx state=%s state_err=%s rollback_possible=%s",
                    rollbackReason,
                    partitionLabelOrUnknown(running),
                    static_cast<unsigned long>(partitionAddressOrZero(running)),
                    stateErr == ESP_OK ? otaStateName(state) : "unknown",
                    esp_err_to_name(stateErr),
                    esp_ota_check_rollback_is_possible() ? "yes" : "no");
#if ESP32BASE_ENABLE_FILELOG
    Esp32BaseFileLog::flush();
#endif
    delay(50);
    const esp_err_t err = esp_ota_mark_app_invalid_rollback_and_reboot();
    if (err != ESP_OK) {
        ESP32BASE_LOG_E("ota", "rollback_mark_invalid_failed err=%s fallback=restart", esp_err_to_name(err));
        Esp32BaseSystem::restart(rollbackReason);
    }
}

#endif
